Revit 2024 API
MEPNetworkIterator Constructor (Document, MEPAnalyticalModelData, ConnectorDomainType)
 Creates an iterator by the analytical model data to visit all connected components in the network.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public MEPNetworkIterator(
	Document pADoc,
	MEPAnalyticalModelData seed,
	ConnectorDomainType eDomain
)
Visual Basic
Public Sub New ( _
	pADoc As Document, _
	seed As MEPAnalyticalModelData, _
	eDomain As ConnectorDomainType _
)
Visual C++
public:
MEPNetworkIterator(
	Document^ pADoc,
	MEPAnalyticalModelData^ seed,
	ConnectorDomainType eDomain
)
Parameters
pADoc
Type: Autodesk.Revit.DB.Document
 The document of the analytical network.
seed
Type: Autodesk.Revit.DB.Analysis.MEPAnalyticalModelData
 The analytical model data of the starting element.
eDomain
Type: Autodesk.Revit.DB.ConnectorDomainType
 The domain of network that the iteration happens.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
MEPNetworkIterator Class
MEPNetworkIterator Overload
Autodesk.Revit.DB.Analysis Namespace